{"name":"André Rosado Hernández","image":"https://cdn.intra.42.fr/users/6327b5f83861af6e77afaf96af1fa73d/arosado-.jpg","campus":"Lisboa","cursus":"42cursus","grade":"Member","projects":[{"name":"Libft","description":"This project is your very first project as a student at 42. You will need to recode a few functions of the C standard library as well as some other utility functions that you will use during your whole cursus.","keywords":["Unix logic"],"difficulty":462},{"name":"ft_printf","description":"This project is pretty straightforward, you have to recode printf. You will learn what is and how to implement variadic functions. Once you validate it, you will reuse this function in your future projects. ","keywords":["Unix logic"],"difficulty":882},{"name":"cub3d","description":"This project is inspired by the world-famous eponymous 90's game, which was the first FPS ever. It will enable you to explore ray-casting. Your goal will be to make a dynamic view inside a maze, in which you'll have to find your way.","keywords":["Applicative"],"difficulty":5775},{"name":"get_next_line","description":"May it be a file, stdin, or even later a network connection, you will always need a way to read content line by line. It is time to start working on this function, which will be essential for your future projects.","keywords":["Unix logic"],"difficulty":882},{"name":"minishell","description":"The objective of this project is for you to create a simple shell.","keywords":["Unix logic"],"difficulty":2814},{"name":"webserv","description":"This project is here to make you write your own HTTP server.\nYou will be able to test it with a real browser.\nHTTP is one of the most used protocol on internet.\nKnowing its arcane will be useful, even if you won't be working on a\nwebsite.\n","keywords":["Network"],"difficulty":21630},{"name":"ft_containers","description":"The multiple available containers in C++ all have a very different usage. To make sure you understand them all, let's re-implement them!","keywords":["OOP"],"difficulty":10042},{"name":"ft_transcendence","description":"Surprise\n","keywords":["Specs"],"difficulty":24360},{"name":"push_swap","description":"This project involves sorting data on a stack, with a limited set of instructions, and the smallest number of moves. To make this happen, you will have to manipulate various sorting algorithms and choose the most appropriate solution(s) for optimized data sorting.","keywords":["Sorting algorithms","Battery concept and handling elements","Algorithm implementation"],"difficulty":1855},{"name":"fract-ol","description":"Discover 2D programming and the psychedelic universe of fractals in this project, using minilibX.","keywords":["2D programming","Optimization techniques","Some Maths"],"difficulty":1000},{"name":"CPP Module 00","description":"This first module of C++ is designed to help you understand the specifities of the language when compared to C.\nTime to dive into Object Oriented Programming!\n","keywords":["Imperative programming","Object-oriented programming","Rigor","OOP"],"difficulty":0},{"name":"CPP Module 01","description":"This module is designed to help you understand the memory allocation, reference, pointers to members and the usage of the switch in CPP.","keywords":["Imperative programming","Object-oriented programming","Rigor","OOP"],"difficulty":0},{"name":"CPP Module 02","description":"This module is designed to help you understand Ad-hoc polymorphism, overloads and orthodox canonical classes in CPP.","keywords":["Imperative programming","Object-oriented programming","Rigor","OOP"],"difficulty":0},{"name":"CPP Module 03","description":"This module is designed to help you understand Inheritance in CPP.","keywords":["Imperative programming","Object-oriented programming","Rigor"],"difficulty":0},{"name":"CPP Module 04","description":"This module is designed to help you understand Subtype polymorphism, abstract classes and interfaces in CPP.","keywords":["Imperative programming","Object-oriented programming","Rigor"],"difficulty":9660},{"name":"CPP Module 05","description":"This module is designed to help you understand Try/Catch and Exceptions in CPP.","keywords":["Imperative programming","Object-oriented programming","Rigor"],"difficulty":0},{"name":"CPP Module 06","description":"This module is designed to help you understand the different casts in CPP.","keywords":["Imperative programming","Object-oriented programming","Rigor"],"difficulty":0},{"name":"CPP Module 07","description":"This module is designed to help you understand Templates in CPP.","keywords":["Imperative programming","Object-oriented programming","Rigor"],"difficulty":0},{"name":"CPP Module 08","description":"This module is designed to help you understand templated containers, iterators and algorithms in CPP.","keywords":["Imperative programming","Object-oriented programming","Rigor"],"difficulty":0},{"name":"Inception","description":"  This project aims to broaden your knowledge of system administration by using Docker.\n You will virtualize several Docker images, creating them in your new personal virtual machine.\n","keywords":["System administration"],"difficulty":10042},{"name":"pipex","description":"This project aims to deepen your understanding of the two concepts that you already know: Redirections and Pipes. It is an introductory project for the bigger UNIX projects that will appear later on in the cursus.","keywords":["Unix logic"],"difficulty":1142},{"name":"NetPractice","description":"NetPractice is a general practical exercise to let you discover networking.","keywords":[],"difficulty":3160}]}